/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub type PsLinkType = ::std::os::raw::c_uint;
pub const PsConnectStatus_ConnectUNKNOWN: PsConnectStatus = 0;
pub const PsConnectStatus_Unconnected: PsConnectStatus = 1;
pub const PsConnectStatus_Connected: PsConnectStatus = 2;
pub const PsConnectStatus_Opened: PsConnectStatus = 3;
pub type PsConnectStatus = ::std::os::raw::c_uint;
pub const PsDeviceType_NONE: PsDeviceType = 0;
pub const PsDeviceType_DCAM305: PsDeviceType = 305;
pub const PsDeviceType_DCAM500: PsDeviceType = 500;
pub const PsDeviceType_CSI100: PsDeviceType = 501;
pub const PsDeviceType_DCAM510: PsDeviceType = 510;
pub const PsDeviceType_DCAM550U: PsDeviceType = 550;
pub const PsDeviceType_DCAM550P: PsDeviceType = 551;
pub const PsDeviceType_DCAM550E: PsDeviceType = 552;
pub const PsDeviceType_DCAM560: PsDeviceType = 560;
pub const PsDeviceType_DCAM560CPRO: PsDeviceType = 561;
pub const PsDeviceType_DCAM560CLITE: PsDeviceType = 562;
pub const PsDeviceType_DCAM710: PsDeviceType = 710;
pub const PsDeviceType_DCAM800: PsDeviceType = 800;
pub const PsDeviceType_DCAM_MIPI: PsDeviceType = 801;
pub const PsDeviceType_DCAM800LITE: PsDeviceType = 802;
pub const PsDeviceType_DCAM800LITEUSB: PsDeviceType = 803;
pub const PsDeviceType_DCAM101: PsDeviceType = 804;
pub const PsDeviceType_MAX: PsDeviceType = 805;
pub type PsDeviceType = ::std::os::raw::c_uint;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type PsDepthPixel = u16;
pub type PsGray16Pixel = u16;
pub type PsGray8Pixel = u8;
#[doc = " @brief Color image pixel type in 24-bit RGB format."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsRGB888Pixel {
    #[doc = "!< Red"]
    pub r: u8,
    #[doc = "!< Green"]
    pub g: u8,
    #[doc = "!< Blue"]
    pub b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsRGB888Pixel"][::std::mem::size_of::<PsRGB888Pixel>() - 3usize];
    ["Alignment of PsRGB888Pixel"][::std::mem::align_of::<PsRGB888Pixel>() - 1usize];
    ["Offset of field: PsRGB888Pixel::r"][::std::mem::offset_of!(PsRGB888Pixel, r) - 0usize];
    ["Offset of field: PsRGB888Pixel::g"][::std::mem::offset_of!(PsRGB888Pixel, g) - 1usize];
    ["Offset of field: PsRGB888Pixel::b"][::std::mem::offset_of!(PsRGB888Pixel, b) - 2usize];
};
#[doc = " @brief Color image pixel type in 24-bit BGR format."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsBGR888Pixel {
    #[doc = "!< Blue"]
    pub b: u8,
    #[doc = "!< Green"]
    pub g: u8,
    #[doc = "!< Red"]
    pub r: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsBGR888Pixel"][::std::mem::size_of::<PsBGR888Pixel>() - 3usize];
    ["Alignment of PsBGR888Pixel"][::std::mem::align_of::<PsBGR888Pixel>() - 1usize];
    ["Offset of field: PsBGR888Pixel::b"][::std::mem::offset_of!(PsBGR888Pixel, b) - 0usize];
    ["Offset of field: PsBGR888Pixel::g"][::std::mem::offset_of!(PsBGR888Pixel, g) - 1usize];
    ["Offset of field: PsBGR888Pixel::r"][::std::mem::offset_of!(PsBGR888Pixel, r) - 2usize];
};
#[doc = " @brief Specifies the frame mode including the pixel format, resolution, and frame rate."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PsFrameMode {
    #[doc = "!< The pixel format used by a frame."]
    pub pixelFormat: PsPixelFormat,
    #[doc = "!< The width of the image, in pixels."]
    pub resolutionWidth: i32,
    #[doc = "!< The height of the image, in pixels."]
    pub resolutionHeight: i32,
    #[doc = "!< The image stream frame rate."]
    pub fps: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsFrameMode"][::std::mem::size_of::<PsFrameMode>() - 16usize];
    ["Alignment of PsFrameMode"][::std::mem::align_of::<PsFrameMode>() - 1usize];
    ["Offset of field: PsFrameMode::pixelFormat"]
        [::std::mem::offset_of!(PsFrameMode, pixelFormat) - 0usize];
    ["Offset of field: PsFrameMode::resolutionWidth"]
        [::std::mem::offset_of!(PsFrameMode, resolutionWidth) - 4usize];
    ["Offset of field: PsFrameMode::resolutionHeight"]
        [::std::mem::offset_of!(PsFrameMode, resolutionHeight) - 8usize];
    ["Offset of field: PsFrameMode::fps"][::std::mem::offset_of!(PsFrameMode, fps) - 12usize];
};
impl Default for PsFrameMode {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Stores the x, y, and z components of a 3D vector."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsVector3f {
    #[doc = "!< The x, y, and z components of the vector."]
    pub x: f32,
    #[doc = "!< The x, y, and z components of the vector."]
    pub y: f32,
    #[doc = "!< The x, y, and z components of the vector."]
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsVector3f"][::std::mem::size_of::<PsVector3f>() - 12usize];
    ["Alignment of PsVector3f"][::std::mem::align_of::<PsVector3f>() - 1usize];
    ["Offset of field: PsVector3f::x"][::std::mem::offset_of!(PsVector3f, x) - 0usize];
    ["Offset of field: PsVector3f::y"][::std::mem::offset_of!(PsVector3f, y) - 4usize];
    ["Offset of field: PsVector3f::z"][::std::mem::offset_of!(PsVector3f, z) - 8usize];
};
#[doc = " @brief Stores the x, y, and z components of a 2D vector."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsVector2u16 {
    pub x: u16,
    pub y: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsVector2u16"][::std::mem::size_of::<PsVector2u16>() - 4usize];
    ["Alignment of PsVector2u16"][::std::mem::align_of::<PsVector2u16>() - 1usize];
    ["Offset of field: PsVector2u16::x"][::std::mem::offset_of!(PsVector2u16, x) - 0usize];
    ["Offset of field: PsVector2u16::y"][::std::mem::offset_of!(PsVector2u16, y) - 2usize];
};
#[doc = " @brief Contains depth information for a given pixel."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsDepthVector3 {
    #[doc = "!< The x coordinate of the pixel."]
    pub depthX: ::std::os::raw::c_int,
    #[doc = "!< The y coordinate of the pixel."]
    pub depthY: ::std::os::raw::c_int,
    #[doc = "!< The depth of the pixel, in millimeters."]
    pub depthZ: PsDepthPixel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsDepthVector3"][::std::mem::size_of::<PsDepthVector3>() - 10usize];
    ["Alignment of PsDepthVector3"][::std::mem::align_of::<PsDepthVector3>() - 1usize];
    ["Offset of field: PsDepthVector3::depthX"]
        [::std::mem::offset_of!(PsDepthVector3, depthX) - 0usize];
    ["Offset of field: PsDepthVector3::depthY"]
        [::std::mem::offset_of!(PsDepthVector3, depthY) - 4usize];
    ["Offset of field: PsDepthVector3::depthZ"]
        [::std::mem::offset_of!(PsDepthVector3, depthZ) - 8usize];
};
#[doc = " @brief Camera intrinsic parameters and distortion coefficients."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsCameraParameters {
    #[doc = "!< Focal length x (pixel)"]
    pub fx: f64,
    #[doc = "!< Focal length y (pixel)"]
    pub fy: f64,
    #[doc = "!< Principal point x (pixel)"]
    pub cx: f64,
    #[doc = "!< Principal point y (pixel)"]
    pub cy: f64,
    #[doc = "!< Radial distortion coefficient, 1st-order"]
    pub k1: f64,
    #[doc = "!< Radial distortion coefficient, 2nd-order"]
    pub k2: f64,
    #[doc = "!< Tangential distortion coefficient"]
    pub p1: f64,
    #[doc = "!< Tangential distortion coefficient"]
    pub p2: f64,
    #[doc = "!< Radial distortion coefficient, 3rd-order"]
    pub k3: f64,
    #[doc = "!< Radial distortion coefficient, 4st-order"]
    pub k4: f64,
    #[doc = "!< Radial distortion coefficient, 5nd-order"]
    pub k5: f64,
    #[doc = "!< Radial distortion coefficient, 6rd-order"]
    pub k6: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsCameraParameters"][::std::mem::size_of::<PsCameraParameters>() - 96usize];
    ["Alignment of PsCameraParameters"][::std::mem::align_of::<PsCameraParameters>() - 1usize];
    ["Offset of field: PsCameraParameters::fx"]
        [::std::mem::offset_of!(PsCameraParameters, fx) - 0usize];
    ["Offset of field: PsCameraParameters::fy"]
        [::std::mem::offset_of!(PsCameraParameters, fy) - 8usize];
    ["Offset of field: PsCameraParameters::cx"]
        [::std::mem::offset_of!(PsCameraParameters, cx) - 16usize];
    ["Offset of field: PsCameraParameters::cy"]
        [::std::mem::offset_of!(PsCameraParameters, cy) - 24usize];
    ["Offset of field: PsCameraParameters::k1"]
        [::std::mem::offset_of!(PsCameraParameters, k1) - 32usize];
    ["Offset of field: PsCameraParameters::k2"]
        [::std::mem::offset_of!(PsCameraParameters, k2) - 40usize];
    ["Offset of field: PsCameraParameters::p1"]
        [::std::mem::offset_of!(PsCameraParameters, p1) - 48usize];
    ["Offset of field: PsCameraParameters::p2"]
        [::std::mem::offset_of!(PsCameraParameters, p2) - 56usize];
    ["Offset of field: PsCameraParameters::k3"]
        [::std::mem::offset_of!(PsCameraParameters, k3) - 64usize];
    ["Offset of field: PsCameraParameters::k4"]
        [::std::mem::offset_of!(PsCameraParameters, k4) - 72usize];
    ["Offset of field: PsCameraParameters::k5"]
        [::std::mem::offset_of!(PsCameraParameters, k5) - 80usize];
    ["Offset of field: PsCameraParameters::k6"]
        [::std::mem::offset_of!(PsCameraParameters, k6) - 88usize];
};
#[doc = " @brief Specifies the camera’s location and orientation extrinsic parameters."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsCameraExtrinsicParameters {
    #[doc = "!< Orientation stored as an array of 9 double representing a 3x3 rotation matrix."]
    pub rotation: [f64; 9usize],
    #[doc = "!< Location stored as an array of 3 double representing a 3-D translation vector."]
    pub translation: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsCameraExtrinsicParameters"]
        [::std::mem::size_of::<PsCameraExtrinsicParameters>() - 96usize];
    ["Alignment of PsCameraExtrinsicParameters"]
        [::std::mem::align_of::<PsCameraExtrinsicParameters>() - 1usize];
    ["Offset of field: PsCameraExtrinsicParameters::rotation"]
        [::std::mem::offset_of!(PsCameraExtrinsicParameters, rotation) - 0usize];
    ["Offset of field: PsCameraExtrinsicParameters::translation"]
        [::std::mem::offset_of!(PsCameraExtrinsicParameters, translation) - 72usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsTimeStamp {
    pub tm_sec: u16,
    pub tm_min: u16,
    pub tm_hour: u16,
    pub tm_msec: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsTimeStamp"][::std::mem::size_of::<PsTimeStamp>() - 8usize];
    ["Alignment of PsTimeStamp"][::std::mem::align_of::<PsTimeStamp>() - 1usize];
    ["Offset of field: PsTimeStamp::tm_sec"][::std::mem::offset_of!(PsTimeStamp, tm_sec) - 0usize];
    ["Offset of field: PsTimeStamp::tm_min"][::std::mem::offset_of!(PsTimeStamp, tm_min) - 2usize];
    ["Offset of field: PsTimeStamp::tm_hour"]
        [::std::mem::offset_of!(PsTimeStamp, tm_hour) - 4usize];
    ["Offset of field: PsTimeStamp::tm_msec"]
        [::std::mem::offset_of!(PsTimeStamp, tm_msec) - 6usize];
};
#[doc = " @brief Depth/IR/RGB image frame data."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PsFrame {
    #[doc = "!< The index of the frame."]
    pub frameIndex: u32,
    #[doc = "!< The type of frame. See ::PsFrameType for more information."]
    pub frameType: PsFrameType,
    #[doc = "!< The pixel format used by a frame. See ::PsPixelFormat for more information."]
    pub pixelFormat: PsPixelFormat,
    #[doc = "!< Used to synchronize with IMU, in the range of 0 to 255."]
    pub imuFrameNo: u8,
    #[doc = "!< A buffer containing the frame’s image data."]
    pub pFrameData: *mut u8,
    #[doc = "!< The length of pFrame, in bytes."]
    pub dataLen: u32,
    #[doc = "!< The exposure time, in milliseconds."]
    pub exposureTime: f32,
    #[doc = "!< The depth range mode of the current frame. Used only for depth frames."]
    pub depthRange: PsDepthRange,
    #[doc = "!< The width of the frame, in pixels."]
    pub width: u16,
    #[doc = "!< The height of the frame, in pixels."]
    pub height: u16,
    #[doc = "!< The timestamp of the frame that decoded."]
    pub timestamp: PsTimeStamp,
    #[doc = "!< The timestamp of the camera."]
    pub hardwaretimestamp: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsFrame"][::std::mem::size_of::<PsFrame>() - 53usize];
    ["Alignment of PsFrame"][::std::mem::align_of::<PsFrame>() - 1usize];
    ["Offset of field: PsFrame::frameIndex"][::std::mem::offset_of!(PsFrame, frameIndex) - 0usize];
    ["Offset of field: PsFrame::frameType"][::std::mem::offset_of!(PsFrame, frameType) - 4usize];
    ["Offset of field: PsFrame::pixelFormat"]
        [::std::mem::offset_of!(PsFrame, pixelFormat) - 8usize];
    ["Offset of field: PsFrame::imuFrameNo"][::std::mem::offset_of!(PsFrame, imuFrameNo) - 12usize];
    ["Offset of field: PsFrame::pFrameData"][::std::mem::offset_of!(PsFrame, pFrameData) - 13usize];
    ["Offset of field: PsFrame::dataLen"][::std::mem::offset_of!(PsFrame, dataLen) - 21usize];
    ["Offset of field: PsFrame::exposureTime"]
        [::std::mem::offset_of!(PsFrame, exposureTime) - 25usize];
    ["Offset of field: PsFrame::depthRange"][::std::mem::offset_of!(PsFrame, depthRange) - 29usize];
    ["Offset of field: PsFrame::width"][::std::mem::offset_of!(PsFrame, width) - 33usize];
    ["Offset of field: PsFrame::height"][::std::mem::offset_of!(PsFrame, height) - 35usize];
    ["Offset of field: PsFrame::timestamp"][::std::mem::offset_of!(PsFrame, timestamp) - 37usize];
    ["Offset of field: PsFrame::hardwaretimestamp"]
        [::std::mem::offset_of!(PsFrame, hardwaretimestamp) - 45usize];
};
impl Default for PsFrame {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief WDR (Wide Dynamic Range) output mode settings (e.g. Near/Far range fusion)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PsWDROutputMode {
    #[doc = "!< The number of ranges supported. Currently only two or three ranges are supported (e.g. Near/Far or Near/Mid/Far)."]
    pub totalRange: PsWDRTotalRange,
    #[doc = "!< The first range."]
    pub range1: PsDepthRange,
    #[doc = "!< The count of successive <code>range1</code> frames."]
    pub range1Count: u8,
    #[doc = "!< The second range."]
    pub range2: PsDepthRange,
    #[doc = "!< The count of successive <code>range2</code> frames."]
    pub range2Count: u8,
    #[doc = "!< Third range. This range only takes effect when <code>totalRange</code> is set to <code>3</code>."]
    pub range3: PsDepthRange,
    #[doc = "!< The count of successive <code>range3</code> frames. This only takes effect when <code>totalRange</code> is set to <code>3</code>."]
    pub range3Count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsWDROutputMode"][::std::mem::size_of::<PsWDROutputMode>() - 19usize];
    ["Alignment of PsWDROutputMode"][::std::mem::align_of::<PsWDROutputMode>() - 1usize];
    ["Offset of field: PsWDROutputMode::totalRange"]
        [::std::mem::offset_of!(PsWDROutputMode, totalRange) - 0usize];
    ["Offset of field: PsWDROutputMode::range1"]
        [::std::mem::offset_of!(PsWDROutputMode, range1) - 4usize];
    ["Offset of field: PsWDROutputMode::range1Count"]
        [::std::mem::offset_of!(PsWDROutputMode, range1Count) - 8usize];
    ["Offset of field: PsWDROutputMode::range2"]
        [::std::mem::offset_of!(PsWDROutputMode, range2) - 9usize];
    ["Offset of field: PsWDROutputMode::range2Count"]
        [::std::mem::offset_of!(PsWDROutputMode, range2Count) - 13usize];
    ["Offset of field: PsWDROutputMode::range3"]
        [::std::mem::offset_of!(PsWDROutputMode, range3) - 14usize];
    ["Offset of field: PsWDROutputMode::range3Count"]
        [::std::mem::offset_of!(PsWDROutputMode, range3Count) - 18usize];
};
impl Default for PsWDROutputMode {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Specifies the GMMGain including the gain value and option type."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsGMMGain {
    #[doc = "!< The GMM gain value of the device."]
    pub gain: u16,
    #[doc = "!< The option type of setting the GMM gain effective time. 0:Immediate effect, invalid after camera closure; 1:Permanent entry into force."]
    pub option: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsGMMGain"][::std::mem::size_of::<PsGMMGain>() - 3usize];
    ["Alignment of PsGMMGain"][::std::mem::align_of::<PsGMMGain>() - 1usize];
    ["Offset of field: PsGMMGain::gain"][::std::mem::offset_of!(PsGMMGain, gain) - 0usize];
    ["Offset of field: PsGMMGain::option"][::std::mem::offset_of!(PsGMMGain, option) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsFrameReady {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsFrameReady"][::std::mem::size_of::<PsFrameReady>() - 4usize];
    ["Alignment of PsFrameReady"][::std::mem::align_of::<PsFrameReady>() - 1usize];
};
impl PsFrameReady {
    #[inline]
    pub fn depth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_depth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn depth_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_depth_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ir(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ir(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ir_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ir_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rgb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rgb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rgb_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_rgb_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mappedRGB(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mappedRGB(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mappedRGB_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mappedRGB_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mappedDepth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mappedDepth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mappedDepth_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mappedDepth_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mappedIR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mappedIR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mappedIR_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mappedIR_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn confidence(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_confidence(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn confidence_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_confidence_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn wdrDepth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wdrDepth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn wdrDepth_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_wdrDepth_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        depth: u32,
        ir: u32,
        rgb: u32,
        mappedRGB: u32,
        mappedDepth: u32,
        mappedIR: u32,
        confidence: u32,
        wdrDepth: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let depth: u32 = unsafe { ::std::mem::transmute(depth) };
            depth as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ir: u32 = unsafe { ::std::mem::transmute(ir) };
            ir as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let rgb: u32 = unsafe { ::std::mem::transmute(rgb) };
            rgb as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let mappedRGB: u32 = unsafe { ::std::mem::transmute(mappedRGB) };
            mappedRGB as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let mappedDepth: u32 = unsafe { ::std::mem::transmute(mappedDepth) };
            mappedDepth as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let mappedIR: u32 = unsafe { ::std::mem::transmute(mappedIR) };
            mappedIR as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let confidence: u32 = unsafe { ::std::mem::transmute(confidence) };
            confidence as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let wdrDepth: u32 = unsafe { ::std::mem::transmute(wdrDepth) };
            wdrDepth as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type PsDeviceHandle = *mut ::std::os::raw::c_void;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PsDeviceInfo {
    pub SessionCount: ::std::os::raw::c_int,
    pub devicetype: PsDeviceType,
    pub uri: [::std::os::raw::c_char; 256usize],
    pub fw: [::std::os::raw::c_char; 50usize],
    pub alias: [::std::os::raw::c_char; 64usize],
    pub status: PsConnectStatus,
    pub ip: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsDeviceInfo"][::std::mem::size_of::<PsDeviceInfo>() - 398usize];
    ["Alignment of PsDeviceInfo"][::std::mem::align_of::<PsDeviceInfo>() - 1usize];
    ["Offset of field: PsDeviceInfo::SessionCount"]
        [::std::mem::offset_of!(PsDeviceInfo, SessionCount) - 0usize];
    ["Offset of field: PsDeviceInfo::devicetype"]
        [::std::mem::offset_of!(PsDeviceInfo, devicetype) - 4usize];
    ["Offset of field: PsDeviceInfo::uri"][::std::mem::offset_of!(PsDeviceInfo, uri) - 8usize];
    ["Offset of field: PsDeviceInfo::fw"][::std::mem::offset_of!(PsDeviceInfo, fw) - 264usize];
    ["Offset of field: PsDeviceInfo::alias"]
        [::std::mem::offset_of!(PsDeviceInfo, alias) - 314usize];
    ["Offset of field: PsDeviceInfo::status"]
        [::std::mem::offset_of!(PsDeviceInfo, status) - 378usize];
    ["Offset of field: PsDeviceInfo::ip"][::std::mem::offset_of!(PsDeviceInfo, ip) - 382usize];
};
impl Default for PsDeviceInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsDataModeList {
    pub count: u8,
    pub datamodelist: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsDataModeList"][::std::mem::size_of::<PsDataModeList>() - 33usize];
    ["Alignment of PsDataModeList"][::std::mem::align_of::<PsDataModeList>() - 1usize];
    ["Offset of field: PsDataModeList::count"]
        [::std::mem::offset_of!(PsDataModeList, count) - 0usize];
    ["Offset of field: PsDataModeList::datamodelist"]
        [::std::mem::offset_of!(PsDataModeList, datamodelist) - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsDepthRangeList {
    pub count: u8,
    pub depthrangelist: [u8; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsDepthRangeList"][::std::mem::size_of::<PsDepthRangeList>() - 10usize];
    ["Alignment of PsDepthRangeList"][::std::mem::align_of::<PsDepthRangeList>() - 1usize];
    ["Offset of field: PsDepthRangeList::count"]
        [::std::mem::offset_of!(PsDepthRangeList, count) - 0usize];
    ["Offset of field: PsDepthRangeList::depthrangelist"]
        [::std::mem::offset_of!(PsDepthRangeList, depthrangelist) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsMeasuringRange {
    pub depthMode: u8,
    pub depthMaxNear: u16,
    pub depthMaxMid: u16,
    pub depthMaxFar: u16,
    pub effectDepthMaxNear: u16,
    pub effectDepthMaxMid: u16,
    pub effectDepthMaxFar: u16,
    pub effectDepthMinNear: u16,
    pub effectDepthMinMid: u16,
    pub effectDepthMinFar: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsMeasuringRange"][::std::mem::size_of::<PsMeasuringRange>() - 19usize];
    ["Alignment of PsMeasuringRange"][::std::mem::align_of::<PsMeasuringRange>() - 1usize];
    ["Offset of field: PsMeasuringRange::depthMode"]
        [::std::mem::offset_of!(PsMeasuringRange, depthMode) - 0usize];
    ["Offset of field: PsMeasuringRange::depthMaxNear"]
        [::std::mem::offset_of!(PsMeasuringRange, depthMaxNear) - 1usize];
    ["Offset of field: PsMeasuringRange::depthMaxMid"]
        [::std::mem::offset_of!(PsMeasuringRange, depthMaxMid) - 3usize];
    ["Offset of field: PsMeasuringRange::depthMaxFar"]
        [::std::mem::offset_of!(PsMeasuringRange, depthMaxFar) - 5usize];
    ["Offset of field: PsMeasuringRange::effectDepthMaxNear"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMaxNear) - 7usize];
    ["Offset of field: PsMeasuringRange::effectDepthMaxMid"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMaxMid) - 9usize];
    ["Offset of field: PsMeasuringRange::effectDepthMaxFar"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMaxFar) - 11usize];
    ["Offset of field: PsMeasuringRange::effectDepthMinNear"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMinNear) - 13usize];
    ["Offset of field: PsMeasuringRange::effectDepthMinMid"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMinMid) - 15usize];
    ["Offset of field: PsMeasuringRange::effectDepthMinFar"]
        [::std::mem::offset_of!(PsMeasuringRange, effectDepthMinFar) - 17usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsTalDelay {
    pub range: u8,
    pub value0: u16,
    pub value1: u16,
    pub value2: u16,
    pub value3: u16,
    pub value4: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsTalDelay"][::std::mem::size_of::<PsTalDelay>() - 11usize];
    ["Alignment of PsTalDelay"][::std::mem::align_of::<PsTalDelay>() - 1usize];
    ["Offset of field: PsTalDelay::range"][::std::mem::offset_of!(PsTalDelay, range) - 0usize];
    ["Offset of field: PsTalDelay::value0"][::std::mem::offset_of!(PsTalDelay, value0) - 1usize];
    ["Offset of field: PsTalDelay::value1"][::std::mem::offset_of!(PsTalDelay, value1) - 3usize];
    ["Offset of field: PsTalDelay::value2"][::std::mem::offset_of!(PsTalDelay, value2) - 5usize];
    ["Offset of field: PsTalDelay::value3"][::std::mem::offset_of!(PsTalDelay, value3) - 7usize];
    ["Offset of field: PsTalDelay::value4"][::std::mem::offset_of!(PsTalDelay, value4) - 9usize];
};
#[doc = " @brief WDR (Wide Dynamic Range) output mode settings (e.g. Near/Far range fusion)."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsWDRPulseCount {
    #[doc = "!< The pulseCount of the first range."]
    pub pulseCount1: u16,
    #[doc = "!< The pulseCount of the second range."]
    pub pulseCount2: u16,
    #[doc = "!< The pulseCount of the third range."]
    pub pulseCount3: u16,
    pub option: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsWDRPulseCount"][::std::mem::size_of::<PsWDRPulseCount>() - 7usize];
    ["Alignment of PsWDRPulseCount"][::std::mem::align_of::<PsWDRPulseCount>() - 1usize];
    ["Offset of field: PsWDRPulseCount::pulseCount1"]
        [::std::mem::offset_of!(PsWDRPulseCount, pulseCount1) - 0usize];
    ["Offset of field: PsWDRPulseCount::pulseCount2"]
        [::std::mem::offset_of!(PsWDRPulseCount, pulseCount2) - 2usize];
    ["Offset of field: PsWDRPulseCount::pulseCount3"]
        [::std::mem::offset_of!(PsWDRPulseCount, pulseCount3) - 4usize];
    ["Offset of field: PsWDRPulseCount::option"]
        [::std::mem::offset_of!(PsWDRPulseCount, option) - 6usize];
};
#[doc = " @brief WDR (Wide Dynamic Range) output mode settings (e.g. Near/Far range fusion)."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PsWDRConfidenceThreshold {
    #[doc = "!< The confidence threshold of the first range."]
    pub threshold1: u16,
    #[doc = "!< The confidence threshold of the second range."]
    pub threshold2: u16,
    #[doc = "!< The confidence threshold of the third range."]
    pub threshold3: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PsWDRConfidenceThreshold"]
        [::std::mem::size_of::<PsWDRConfidenceThreshold>() - 6usize];
    ["Alignment of PsWDRConfidenceThreshold"]
        [::std::mem::align_of::<PsWDRConfidenceThreshold>() - 1usize];
    ["Offset of field: PsWDRConfidenceThreshold::threshold1"]
        [::std::mem::offset_of!(PsWDRConfidenceThreshold, threshold1) - 0usize];
    ["Offset of field: PsWDRConfidenceThreshold::threshold2"]
        [::std::mem::offset_of!(PsWDRConfidenceThreshold, threshold2) - 2usize];
    ["Offset of field: PsWDRConfidenceThreshold::threshold3"]
        [::std::mem::offset_of!(PsWDRConfidenceThreshold, threshold3) - 4usize];
};
#[doc = " @brief hotplug status callback function\n pInfo  return the info of the Device, See ::PsDeviceInfo\n state  0:device added , 1:device removed"]
pub type PtrHotPlugStatusCallback = ::std::option::Option<
    unsafe extern "C" fn(pInfo: *const PsDeviceInfo, state: ::std::os::raw::c_int),
>;
#[doc = " @brief hotplug status callback function for c plus plus\n pInfo  return the info of the Device, See ::PsDeviceInfo\n state  0:device added , 1:device removed\n contex pointer to the object of C++ class"]
pub type PtrHotPlugStatusCallback_ = ::std::option::Option<
    unsafe extern "C" fn(
        pInfo: *const PsDeviceInfo,
        state: ::std::os::raw::c_int,
        contex: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
