/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

#[doc = " @brief    Return status codes for all APIs.\n           <code>SC_OK = 0</code> means the API successfully completed its operation.\n           All other codes indicate a device, parameter, or API usage error."]
pub type ScStatus = ::std::os::raw::c_int;
#[doc = "!< Unknown device status and cannot try to open."]
pub const ScConnectStatus_SC_LIMBO: ScConnectStatus = 0;
#[doc = "!< Device connectable state and support open."]
pub const ScConnectStatus_SC_CONNECTABLE: ScConnectStatus = 1;
#[doc = "!< The device is connected and cannot be opened again."]
pub const ScConnectStatus_SC_OPENED: ScConnectStatus = 2;
pub type ScConnectStatus = ::std::os::raw::c_uint;
#[doc = "!< Enter the active mode."]
pub const ScWorkMode_SC_ACTIVE_MODE: ScWorkMode = 0;
#[doc = "!< Enter the hardware salve mode, at this time need to connect\n!< the hardware trigger wire, provide hardware signal, to trigger the image."]
pub const ScWorkMode_SC_HARDWARE_TRIGGER_MODE: ScWorkMode = 1;
#[doc = "!< Enter the software salve mode, at this time need to invoke scSoftwareTriggerOnce, to trigger the image."]
pub const ScWorkMode_SC_SOFTWARE_TRIGGER_MODE: ScWorkMode = 2;
pub type ScWorkMode = ::std::os::raw::c_uint;
#[doc = "!< Enter the auto exposure mode."]
pub const ScExposureControlMode_SC_EXPOSURE_CONTROL_MODE_AUTO: ScExposureControlMode = 0;
#[doc = "!< Enter the manual exposure mode."]
pub const ScExposureControlMode_SC_EXPOSURE_CONTROL_MODE_MANUAL: ScExposureControlMode = 1;
pub type ScExposureControlMode = ::std::os::raw::c_uint;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type ScDepthPixel = u16;
#[doc = " @brief Stores the x, y, and z components of a 3D vector."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScVector3f {
    #[doc = "!< The x components of the vector."]
    pub x: f32,
    #[doc = "!< The y components of the vector."]
    pub y: f32,
    #[doc = "!< The z components of the vector."]
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScVector3f"][::std::mem::size_of::<ScVector3f>() - 12usize];
    ["Alignment of ScVector3f"][::std::mem::align_of::<ScVector3f>() - 1usize];
    ["Offset of field: ScVector3f::x"][::std::mem::offset_of!(ScVector3f, x) - 0usize];
    ["Offset of field: ScVector3f::y"][::std::mem::offset_of!(ScVector3f, y) - 4usize];
    ["Offset of field: ScVector3f::z"][::std::mem::offset_of!(ScVector3f, z) - 8usize];
};
#[doc = " @brief Stores the x and y components of a 2D vector."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScVector2u16 {
    #[doc = "!< The x components of the vector."]
    pub x: u16,
    #[doc = "!< The y components of the vector."]
    pub y: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScVector2u16"][::std::mem::size_of::<ScVector2u16>() - 4usize];
    ["Alignment of ScVector2u16"][::std::mem::align_of::<ScVector2u16>() - 1usize];
    ["Offset of field: ScVector2u16::x"][::std::mem::offset_of!(ScVector2u16, x) - 0usize];
    ["Offset of field: ScVector2u16::y"][::std::mem::offset_of!(ScVector2u16, y) - 2usize];
};
#[doc = " @brief Contains depth information for a given pixel."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScDepthVector3 {
    #[doc = "!< The x coordinate of the pixel."]
    pub depthX: i32,
    #[doc = "!< The y coordinate of the pixel."]
    pub depthY: i32,
    #[doc = "!< The depth of the pixel, in millimeters."]
    pub depthZ: ScDepthPixel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScDepthVector3"][::std::mem::size_of::<ScDepthVector3>() - 10usize];
    ["Alignment of ScDepthVector3"][::std::mem::align_of::<ScDepthVector3>() - 1usize];
    ["Offset of field: ScDepthVector3::depthX"]
        [::std::mem::offset_of!(ScDepthVector3, depthX) - 0usize];
    ["Offset of field: ScDepthVector3::depthY"]
        [::std::mem::offset_of!(ScDepthVector3, depthY) - 4usize];
    ["Offset of field: ScDepthVector3::depthZ"]
        [::std::mem::offset_of!(ScDepthVector3, depthZ) - 8usize];
};
#[doc = " @brief image resolution."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScResolution {
    pub width: i32,
    pub height: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScResolution"][::std::mem::size_of::<ScResolution>() - 8usize];
    ["Alignment of ScResolution"][::std::mem::align_of::<ScResolution>() - 1usize];
    ["Offset of field: ScResolution::width"][::std::mem::offset_of!(ScResolution, width) - 0usize];
    ["Offset of field: ScResolution::height"]
        [::std::mem::offset_of!(ScResolution, height) - 4usize];
};
#[doc = " @brief Supported resolutions."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScResolutionList {
    pub count: i32,
    pub resolution: [ScResolution; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScResolutionList"][::std::mem::size_of::<ScResolutionList>() - 52usize];
    ["Alignment of ScResolutionList"][::std::mem::align_of::<ScResolutionList>() - 1usize];
    ["Offset of field: ScResolutionList::count"]
        [::std::mem::offset_of!(ScResolutionList, count) - 0usize];
    ["Offset of field: ScResolutionList::resolution"]
        [::std::mem::offset_of!(ScResolutionList, resolution) - 4usize];
};
#[doc = " @brief Camera intrinsic parameters and distortion coefficients."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScSensorIntrinsicParameters {
    #[doc = "!< Focal length x (pixel)."]
    pub fx: f64,
    #[doc = "!< Focal length y (pixel)."]
    pub fy: f64,
    #[doc = "!< Principal point x (pixel)."]
    pub cx: f64,
    #[doc = "!< Principal point y (pixel)."]
    pub cy: f64,
    #[doc = "!< Radial distortion coefficient, 1st-order."]
    pub k1: f64,
    #[doc = "!< Radial distortion coefficient, 2nd-order."]
    pub k2: f64,
    #[doc = "!< Tangential distortion coefficient."]
    pub p1: f64,
    #[doc = "!< Tangential distortion coefficient."]
    pub p2: f64,
    #[doc = "!< Radial distortion coefficient, 3rd-order."]
    pub k3: f64,
    #[doc = "!< Radial distortion coefficient, 4st-order."]
    pub k4: f64,
    #[doc = "!< Radial distortion coefficient, 5nd-order."]
    pub k5: f64,
    #[doc = "!< Radial distortion coefficient, 6rd-order."]
    pub k6: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScSensorIntrinsicParameters"]
        [::std::mem::size_of::<ScSensorIntrinsicParameters>() - 96usize];
    ["Alignment of ScSensorIntrinsicParameters"]
        [::std::mem::align_of::<ScSensorIntrinsicParameters>() - 1usize];
    ["Offset of field: ScSensorIntrinsicParameters::fx"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, fx) - 0usize];
    ["Offset of field: ScSensorIntrinsicParameters::fy"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, fy) - 8usize];
    ["Offset of field: ScSensorIntrinsicParameters::cx"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, cx) - 16usize];
    ["Offset of field: ScSensorIntrinsicParameters::cy"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, cy) - 24usize];
    ["Offset of field: ScSensorIntrinsicParameters::k1"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k1) - 32usize];
    ["Offset of field: ScSensorIntrinsicParameters::k2"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k2) - 40usize];
    ["Offset of field: ScSensorIntrinsicParameters::p1"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, p1) - 48usize];
    ["Offset of field: ScSensorIntrinsicParameters::p2"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, p2) - 56usize];
    ["Offset of field: ScSensorIntrinsicParameters::k3"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k3) - 64usize];
    ["Offset of field: ScSensorIntrinsicParameters::k4"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k4) - 72usize];
    ["Offset of field: ScSensorIntrinsicParameters::k5"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k5) - 80usize];
    ["Offset of field: ScSensorIntrinsicParameters::k6"]
        [::std::mem::offset_of!(ScSensorIntrinsicParameters, k6) - 88usize];
};
#[doc = " @brief Extrinsic parameters defines the physical relationship form tof sensor to color sensor."]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScSensorExtrinsicParameters {
    #[doc = "!< Orientation stored as an array of 9 double representing a 3x3 rotation matrix."]
    pub rotation: [f64; 9usize],
    #[doc = "!< Location stored as an array of 3 double representing a 3-D translation vector."]
    pub translation: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScSensorExtrinsicParameters"]
        [::std::mem::size_of::<ScSensorExtrinsicParameters>() - 96usize];
    ["Alignment of ScSensorExtrinsicParameters"]
        [::std::mem::align_of::<ScSensorExtrinsicParameters>() - 1usize];
    ["Offset of field: ScSensorExtrinsicParameters::rotation"]
        [::std::mem::offset_of!(ScSensorExtrinsicParameters, rotation) - 0usize];
    ["Offset of field: ScSensorExtrinsicParameters::translation"]
        [::std::mem::offset_of!(ScSensorExtrinsicParameters, translation) - 72usize];
};
#[doc = " @brief Depth/IR/Color image frame data."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ScFrame {
    #[doc = "!< The index of the frame."]
    pub frameIndex: u32,
    #[doc = "!< The type of frame. See ::ScFrameType for more information."]
    pub frameType: ScFrameType,
    #[doc = "!< The pixel format used by a frame. See ::ScPixelFormat for more information."]
    pub pixelFormat: ScPixelFormat,
    #[doc = "!< A buffer containing the frame’s image data."]
    pub pFrameData: *mut u8,
    #[doc = "!< The length of pFrame, in bytes."]
    pub dataLen: u32,
    #[doc = "!< The width of the frame, in pixels."]
    pub width: u16,
    #[doc = "!< The height of the frame, in pixels."]
    pub height: u16,
    #[doc = "!< The timestamp(in milliseconds) when the frame be generated on the device. Frame processing and transfer time are not included."]
    pub deviceTimestamp: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScFrame"][::std::mem::size_of::<ScFrame>() - 36usize];
    ["Alignment of ScFrame"][::std::mem::align_of::<ScFrame>() - 1usize];
    ["Offset of field: ScFrame::frameIndex"][::std::mem::offset_of!(ScFrame, frameIndex) - 0usize];
    ["Offset of field: ScFrame::frameType"][::std::mem::offset_of!(ScFrame, frameType) - 4usize];
    ["Offset of field: ScFrame::pixelFormat"]
        [::std::mem::offset_of!(ScFrame, pixelFormat) - 8usize];
    ["Offset of field: ScFrame::pFrameData"][::std::mem::offset_of!(ScFrame, pFrameData) - 12usize];
    ["Offset of field: ScFrame::dataLen"][::std::mem::offset_of!(ScFrame, dataLen) - 20usize];
    ["Offset of field: ScFrame::width"][::std::mem::offset_of!(ScFrame, width) - 24usize];
    ["Offset of field: ScFrame::height"][::std::mem::offset_of!(ScFrame, height) - 26usize];
    ["Offset of field: ScFrame::deviceTimestamp"]
        [::std::mem::offset_of!(ScFrame, deviceTimestamp) - 28usize];
};
impl Default for ScFrame {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScFrameReady {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScFrameReady"][::std::mem::size_of::<ScFrameReady>() - 4usize];
    ["Alignment of ScFrameReady"][::std::mem::align_of::<ScFrameReady>() - 1usize];
};
impl ScFrameReady {
    #[inline]
    pub fn depth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_depth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ir(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ir(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn color(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_color(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transformedColor(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transformedColor(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transformedDepth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transformedDepth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        depth: u32,
        ir: u32,
        color: u32,
        transformedColor: u32,
        transformedDepth: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let depth: u32 = unsafe { ::std::mem::transmute(depth) };
            depth as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ir: u32 = unsafe { ::std::mem::transmute(ir) };
            ir as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let color: u32 = unsafe { ::std::mem::transmute(color) };
            color as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let transformedColor: u32 = unsafe { ::std::mem::transmute(transformedColor) };
            transformedColor as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let transformedDepth: u32 = unsafe { ::std::mem::transmute(transformedDepth) };
            transformedDepth as u64
        });
        __bindgen_bitfield_unit.set(5usize, 27u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ScDeviceHandle = *mut ::std::os::raw::c_void;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ScDeviceInfo {
    #[doc = "!< Product type name."]
    pub productName: [::std::os::raw::c_char; 64usize],
    #[doc = "!< Device serial number."]
    pub serialNumber: [::std::os::raw::c_char; 64usize],
    #[doc = "!< Device IP."]
    pub ip: [::std::os::raw::c_char; 17usize],
    #[doc = "!< Device status."]
    pub status: ScConnectStatus,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScDeviceInfo"][::std::mem::size_of::<ScDeviceInfo>() - 149usize];
    ["Alignment of ScDeviceInfo"][::std::mem::align_of::<ScDeviceInfo>() - 1usize];
    ["Offset of field: ScDeviceInfo::productName"]
        [::std::mem::offset_of!(ScDeviceInfo, productName) - 0usize];
    ["Offset of field: ScDeviceInfo::serialNumber"]
        [::std::mem::offset_of!(ScDeviceInfo, serialNumber) - 64usize];
    ["Offset of field: ScDeviceInfo::ip"][::std::mem::offset_of!(ScDeviceInfo, ip) - 128usize];
    ["Offset of field: ScDeviceInfo::status"]
        [::std::mem::offset_of!(ScDeviceInfo, status) - 145usize];
};
impl Default for ScDeviceInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScTimeFilterParams {
    #[doc = "!< Range in [1, 6],The larger the value is, the more obvious the filtering effect is and The smaller the point cloud wobble."]
    pub threshold: i32,
    #[doc = "!< Whether to enable time filter."]
    pub enable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTimeFilterParams"][::std::mem::size_of::<ScTimeFilterParams>() - 5usize];
    ["Alignment of ScTimeFilterParams"][::std::mem::align_of::<ScTimeFilterParams>() - 1usize];
    ["Offset of field: ScTimeFilterParams::threshold"]
        [::std::mem::offset_of!(ScTimeFilterParams, threshold) - 0usize];
    ["Offset of field: ScTimeFilterParams::enable"]
        [::std::mem::offset_of!(ScTimeFilterParams, enable) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScConfidenceFilterParams {
    #[doc = "!< Range in [1, 100]. The larger the value is, the more obvious the filtering effect is and the more points are filtered out."]
    pub threshold: i32,
    #[doc = "!< Whether to enable confidence filter."]
    pub enable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScConfidenceFilterParams"]
        [::std::mem::size_of::<ScConfidenceFilterParams>() - 5usize];
    ["Alignment of ScConfidenceFilterParams"]
        [::std::mem::align_of::<ScConfidenceFilterParams>() - 1usize];
    ["Offset of field: ScConfidenceFilterParams::threshold"]
        [::std::mem::offset_of!(ScConfidenceFilterParams, threshold) - 0usize];
    ["Offset of field: ScConfidenceFilterParams::enable"]
        [::std::mem::offset_of!(ScConfidenceFilterParams, enable) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScFlyingPixelFilterParams {
    #[doc = "!< Range in [1, 16]. The larger the value is, the more obvious the filtering effect is and the more points are filtered out."]
    pub threshold: i32,
    #[doc = "!< Whether to enable flying pixel filter."]
    pub enable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScFlyingPixelFilterParams"]
        [::std::mem::size_of::<ScFlyingPixelFilterParams>() - 5usize];
    ["Alignment of ScFlyingPixelFilterParams"]
        [::std::mem::align_of::<ScFlyingPixelFilterParams>() - 1usize];
    ["Offset of field: ScFlyingPixelFilterParams::threshold"]
        [::std::mem::offset_of!(ScFlyingPixelFilterParams, threshold) - 0usize];
    ["Offset of field: ScFlyingPixelFilterParams::enable"]
        [::std::mem::offset_of!(ScFlyingPixelFilterParams, enable) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScIRGMMCorrectionParams {
    #[doc = "!< Range in [1, 100]. The larger the value is, the more obvious the correction effect."]
    pub threshold: i32,
    #[doc = "!< Whether to enable IRGMM correction."]
    pub enable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScIRGMMCorrectionParams"][::std::mem::size_of::<ScIRGMMCorrectionParams>() - 5usize];
    ["Alignment of ScIRGMMCorrectionParams"]
        [::std::mem::align_of::<ScIRGMMCorrectionParams>() - 1usize];
    ["Offset of field: ScIRGMMCorrectionParams::threshold"]
        [::std::mem::offset_of!(ScIRGMMCorrectionParams, threshold) - 0usize];
    ["Offset of field: ScIRGMMCorrectionParams::enable"]
        [::std::mem::offset_of!(ScIRGMMCorrectionParams, enable) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScInputSignalParamsForHWTrigger {
    #[doc = "!< Range in [1,65535]. The width of input signal."]
    pub width: u16,
    #[doc = "!< Range in [34000,65535]. The interval of input signal."]
    pub interval: u16,
    #[doc = "!< Range in [0,1]. 0 for active low; 1 for active high."]
    pub polarity: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScInputSignalParamsForHWTrigger"]
        [::std::mem::size_of::<ScInputSignalParamsForHWTrigger>() - 5usize];
    ["Alignment of ScInputSignalParamsForHWTrigger"]
        [::std::mem::align_of::<ScInputSignalParamsForHWTrigger>() - 1usize];
    ["Offset of field: ScInputSignalParamsForHWTrigger::width"]
        [::std::mem::offset_of!(ScInputSignalParamsForHWTrigger, width) - 0usize];
    ["Offset of field: ScInputSignalParamsForHWTrigger::interval"]
        [::std::mem::offset_of!(ScInputSignalParamsForHWTrigger, interval) - 2usize];
    ["Offset of field: ScInputSignalParamsForHWTrigger::polarity"]
        [::std::mem::offset_of!(ScInputSignalParamsForHWTrigger, polarity) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScOutputSignalParams {
    #[doc = "!< Range in [1,65535]. The width of output signal."]
    pub width: u16,
    #[doc = "!< Range in [0,65535]. The delay time of output signal."]
    pub delay: u16,
    #[doc = "!< Range in [0,1]. 0 for active low; 1 for active high."]
    pub polarity: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScOutputSignalParams"][::std::mem::size_of::<ScOutputSignalParams>() - 5usize];
    ["Alignment of ScOutputSignalParams"][::std::mem::align_of::<ScOutputSignalParams>() - 1usize];
    ["Offset of field: ScOutputSignalParams::width"]
        [::std::mem::offset_of!(ScOutputSignalParams, width) - 0usize];
    ["Offset of field: ScOutputSignalParams::delay"]
        [::std::mem::offset_of!(ScOutputSignalParams, delay) - 2usize];
    ["Offset of field: ScOutputSignalParams::polarity"]
        [::std::mem::offset_of!(ScOutputSignalParams, polarity) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScTimeSyncConfig {
    #[doc = "!< 0: disable, 1: NTP, 2: PTP, only NTP needs the ip."]
    pub flag: u8,
    #[doc = "!< just for NTP."]
    pub ip: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTimeSyncConfig"][::std::mem::size_of::<ScTimeSyncConfig>() - 17usize];
    ["Alignment of ScTimeSyncConfig"][::std::mem::align_of::<ScTimeSyncConfig>() - 1usize];
    ["Offset of field: ScTimeSyncConfig::flag"]
        [::std::mem::offset_of!(ScTimeSyncConfig, flag) - 0usize];
    ["Offset of field: ScTimeSyncConfig::ip"]
        [::std::mem::offset_of!(ScTimeSyncConfig, ip) - 1usize];
};
#[doc = " @brief         Hot plug status callback function.\n @param[out]    pInfo     Return the info of the Device, See ::ScDeviceInfo.\n @param[out]    state     Hot plug status. 0:device added , 1:device removed.\n @param[out]    pUserData Pointer to user data, which can be null."]
pub type PtrHotPlugStatusCallback = ::std::option::Option<
    unsafe extern "C" fn(
        pInfo: *const ScDeviceInfo,
        state: ::std::os::raw::c_int,
        pUserData: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @brief         Upgrade status callback function.\n @param[out]    status     Returns the upgrade step status.\n @param[out]    params     Params of upgrade step status , -1:upgrade fail , 0:upgrade Normal, 1-100:upgrade progress.\n @param[out]    pUserData  Pointer to user data, which can be null."]
pub type PtrUpgradeStatusCallback = ::std::option::Option<
